
#include <stdio.h>

// Функция для тестирования моей функции


int main(void) {
    
    
    // Позже здесь будет код!
    
    return 0;
}

/*
 compNumbers
 
 Функция сравнивает два целых числа, и возвращает: 2, если первое больше второго,
 0, если они равны, иначе 1
 
 Параметры:
 1) nF - Старший разряд первого числа
 2) nS - Старший разряд второго числа
 3) fNumb - Первое число
 4) sNumb - Второе число
 
 Функция возвращает результат типа - int
 */


int compNumbers(int nF, int nS, int* fNumb, int* sNumb)
{
    // Когда-нибудь здесь появится код
}

