#include "bfunc.h"
#include "numbN.h"
//----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/*
 
 swapNumb
 
 Функция меняет местами числа
 
 Параметры:
 1) numberOne - Первое число
 2) numberTwo - Второе число
 
 Функция ничего не возвращает
 
 */


void swapNumb(NUMBN* numberOne, NUMBN* numberTwo)
    {
        NUMBN a = *numberTwo;
        *numberTwo = *numberOne;
        *numberOne = a;
    }

//----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/*
 
 turnNumber
 
 Функция переворачивает число
 
 Параметры:
 1) number - Первое число
 2) length - Второе число
 
 Функция ничего не возвращает
 
 */


void turnNumber(int* number, int length)
    {
        for(int i = 0; i < (length/2); ++i)
            {
                int a = *(number + i);
                *(number + i) = *(number + length - i - 1);
                *(number + length - i -1) = a;
            }
    }
